Revit 2024 API
FilterNumericEquals Class
 Tests whether numeric values from the document are equal to a certain value
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public class FilterNumericEquals : FilterNumericRuleEvaluator
Visual Basic
Public Class FilterNumericEquals _
	Inherits FilterNumericRuleEvaluator
Visual C++
public ref class FilterNumericEquals : public FilterNumericRuleEvaluator
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterNumericRuleEvaluator
 Autodesk.Revit.DB.FilterNumericEquals
See Also
FilterNumericEquals Members
Autodesk.Revit.DB Namespace